app/Http/Controllers/Auth/AuthenticatedSessionController.php

select * from `users` where `email` = 'superadmin@example.com' limit 1
select * from `users` where `id` = '0' limit 1
---
    public function store(LoginRequest $request)
    {

        $user = User::where('email',$request->email)->first();
        if($user != null)
        {
            $companyUser = User::where('id' , $user->created_by)->first();

select * from `users` where `users`.`id` = '0' limit 1
---
        $request->session()->regenerate();
        $user = Auth::user();

        $companyUser = User::find($user->created_by);

update `users` set `last_login_at` = '2024-06-14 20:05:09', `users`.`updated_at` = '2024-06-14 20:05:09' where `id` = '1'
---
        date_default_timezone_set($timezone);

        // Update Last Login Time
        $user->update(
            [
                'last_login_at' => Carbon::now()->toDateTimeString(),
            ]
        );